// 假1302，不用DS1302芯片，程序中必须要有调整时间的功能，否则关机再开，又是初始时间

#ifndef __DS1302_H__
#define __DS1302_H__

#include <reg52.h>
#include<intrins.h>


//复位脚
#define RST_CLR	RST=0//电平置低
#define RST_SET	RST=1//电平置高


//双向数据
#define IO_CLR	SDA=0//电平置低
#define IO_SET	SDA=1//电平置高
#define IO_R	SDA  //电平读取


//时钟信号
#define SCK_CLR	SCK=0//时钟信号
#define SCK_SET	SCK=1//电平置高


#define ds1302_sec_add			0x80		//秒数据地址
#define ds1302_min_add			0x82		//分数据地址
#define ds1302_hr_add			0x84		//时数据地址
#define ds1302_date_add			0x86		//日数据地址
#define ds1302_month_add		0x88		//月数据地址
#define ds1302_day_add			0x8a		//星期数据地址
#define ds1302_year_add			0x8c		//年数据地址
#define ds1302_control_add		0x8e		//控制数据地址
#define ds1302_charger_add		0x90 					 
#define ds1302_clkburst_add		0xbe


/*------------------------------------------------
           向DS1302写入一字节数据
------------------------------------------------*/
void Ds1302_Write_Byte(unsigned char addr, unsigned char d);
/*------------------------------------------------
           从DS1302读出一字节数据
------------------------------------------------*/
unsigned char Ds1302_Read_Byte(unsigned char addr) ;
/*------------------------------------------------
           向DS1302写入时钟数据
------------------------------------------------*/
void Ds1302_Write_Time(void) ;
/*------------------------------------------------
           从DS1302读出时钟数据
------------------------------------------------*/
void Ds1302_Read_Time(void)  ;
/*------------------------------------------------
                DS1302初始化
------------------------------------------------*/
void Ds1302_Init(void);

#endif

unsigned int cc=0;

unsigned char time_buf1[8] = {20,18,03,24,20,00,00,7};   //年月日时分秒周


/*------------------------------------------------
           向DS1302写入时钟数据
------------------------------------------------*/
void Ds1302_Write_Time(void) 
{
}

/*------------------------------------------------
           从DS1302读出时钟数据
------------------------------------------------*/
void Ds1302_Read_Time(void)  
{ 
}

/*------------------------------------------------
                DS1302初始化
------------------------------------------------*/
void Ds1302_Init(void)
{
 //使用定时器0作为时钟发生器
 TMOD |= 0x02;	  //使用模式2，八位自动重装定时器		     
 TH0=0x05;	      //给定初值，250ns一个中断
 TL0=0x05;
 EA=1;            //总中断打开
 ET0=1;           //定时器中断打开
 TR0=1;           //定时器开关打开
}


/*------------------------------------------------
                 定时器中断子程序 0
------------------------------------------------*/
void Timer0_isr(void) interrupt 1 using 1
{
 char m=31;  //定义一个月的天数

 cc++;
 if(cc>3670)  // 使用12M晶振时4000, 4M时1327, 11.0592时3670
  {
   cc=0;
   time_buf1[6]++; //秒++
   if(time_buf1[6]>59) //秒进分
    {
     time_buf1[6]=0; 
     time_buf1[5]++;  //分++
     if(time_buf1[5]>59) //分进时
      {
       time_buf1[5]=0; 
       time_buf1[4]++;  //时++
       if(time_buf1[4]>23) //时进日
         {
          time_buf1[4]=0; 
          time_buf1[3]++;  //日++

          if((time_buf1[2]==4)&&(time_buf1[2]==6)&&(time_buf1[2]==9)&&(time_buf1[2]==11))
           m=30;
          if(time_buf1[2]==2) m=28; //二月28天
          if((time_buf1[1]%4==0)&&(time_buf1[2]==2)) m=29; //闰年29天
//还有一种情况不是闰年，年/400为零，也是平年，但2000年已过，下一次是2400年，程序不可能用到那时，所以不考虑

          if(time_buf1[3]>m) //日进月
            {
             time_buf1[3]=1;
             time_buf1[2]++;  //月++
             if(time_buf1[2]>12) //日进月
               {
                time_buf1[2]=1;
                time_buf1[1]++;  //年++
               }
            }
         }
      }
    }// 
  }//end 6
}





